def area(a):
    '''
    Вычисляет площадь квадрата.

    Параметры:
    a (float): длина стороны квадрата

    Возвращаемое значение:
    float: площадь квадрата по формуле S = a ^ 2

    Пример вызова:
    area(4) возвращает 16
    '''
    return a * a


def perimeter(a):
    '''
    Вычисляет периметр квадрата.

    Параметры:
    a (float): длина стороны квадрата

    Возвращаемое значение:
    float: периметр квадрата по формуле P = 4 * a

    Пример вызова:
    perimeter(4) возвращает 16
    '''
    return 4 * a